DOM
    概述
        HTML 文件字节流无法直接被渲染引擎理解，需要将其转化为渲染引擎能够理解的内部结构，这个结构就是 DOM

    作用
        1.从页面视角看，是生成页面的基础数据结构（表述 HTML 的内部数据结构）
        2.从 JS 视角看，为 JS 提供操作文档的结构、样式和内容的接口
        3.从安全视角看，DOM 解析阶段会过滤掉一些不安全的内容

    生成过程
        - 渲染引擎内部，通过一个 "HTML解析器" HTMLParse，对从网络进程传输过来的字节流进行解析

        1.将字节流通过分词器解析为 Token（标签Token、文本Token）
        2.将 Token 推到栈内，同时为该 Token 创建一个 DOM 节点，添加到 DOM 树中
        3.当遇到闭合标签 EndTag 时，HTML 解析器会查看栈顶是否是开始标签 StartTag，是则将 StartTag 从栈中弹出，表示该元素解析完毕

        注意
            - HTML解析器内部维护了一个 Token 栈结构（用于计算父子节点关系）
            - 文本 Token 不会推入到栈内，而是直接创建 DOM 节点添加到 DOM 树中

    关于生成过程中遇到 JS 脚本
        - HTML解析器遇到 <script> 标签时，会停下来
        
        当前是内嵌 JS 代码时
            - 执行该 <script> 标签内的代码，执行完毕后继续解析后续内容

        当前是引用 JS 文件时
            - 先下载该 JS 文件，下载时会阻塞解析过程（网速、文件大小会影响下载速度）
            - 浏览器有内部优化，收到字节流文件后，会开启一个预解析线程，分析 HTML 中包含的 JS、CSS 文件，并提前进行下载

            优化
                1.使用 CDN 加速 JS 文件下载（如一些常见的库）
                2.压缩 JS 文件体积
                3.将没有涉及 DOM 操作的 JS 文件设为异步加载（async、defer）

        当内嵌或引用的 JS 里面涉及到 style 的操作时
            - 需要等待 CSS 文件下载完毕并解析生成 CSSOM 对象之后，才会继续执行 JS
            (V8 引擎在解析 JS 之前，是不知道 JS 是否操纵了 CSSOM 的)


    关于 async 和 defer 的区别
        - 同样都是异步下载， async 下载完毕后就会执行， defer 需要在 DOMContentLoad 事件触发前执行
        - DOMContentLoad事件：DOM树构建完成（所需的 HTML、CSS、JS 都下载完成）
        — load事件：所有资源加载完毕（图像、CSS）